; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v1 - type_2 ?v6 - type_3)
 	      (pred_2 ?v8 - object ?v6 - type_3)
	      (pred_4 ?v1 - type_2 ?v7 - type_1)
	      (pred_3 ?v1 - type_2 ?v8 - object ?v7 - type_1))

   (:action op_3
       :parameters  (?v1 - type_2 ?v5 ?v2 - type_3)
       :precondition (and  (pred_1 ?v1 ?v5))
       :effect (and  (pred_1 ?v1 ?v2)
		     (not (pred_1 ?v1 ?v5))))

   (:action op_2
       :parameters (?v1 - type_2 ?v3 - object ?v4 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v4) (pred_1 ?v1 ?v4) (pred_4 ?v1 ?v7))
       :effect (and (pred_3 ?v1 ?v3 ?v7)
		    (not (pred_2 ?v3 ?v4)) 
		    (not (pred_4 ?v1 ?v7))))

   (:action op_1
       :parameters (?v1 - type_2 ?v3 - object ?v4 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_3 ?v1 ?v3 ?v7) (pred_1 ?v1 ?v4))
       :effect (and (pred_2 ?v3 ?v4)
		    (pred_4 ?v1 ?v7)
		    (not (pred_3 ?v1 ?v3 ?v7)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_06 obj_09 - type_2
obj_13 obj_12 obj_07 obj_04 - type_1
obj_08 obj_01 obj_10 obj_03 - type_3
obj_11 obj_05 obj_02 - object)
(:init
(pred_1 obj_06 obj_08)
(pred_4 obj_06 obj_13)
(pred_4 obj_06 obj_12)
(pred_1 obj_09 obj_10)
(pred_4 obj_09 obj_07)
(pred_4 obj_09 obj_04)
(pred_2 obj_11 obj_08)
(pred_2 obj_05 obj_03)
(pred_2 obj_02 obj_10)
)
(:goal
(and
(pred_2 obj_11 obj_10)
(pred_2 obj_05 obj_01)
(pred_2 obj_02 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_06 obj_03) (pred_1 obj_09 obj_03))))
  )
)
)

; plan
1. (op_2 obj_09 obj_02 obj_10 obj_04)
   deleted: (pred_2 obj_02 obj_10) (pred_4 obj_09 obj_04)
   added: (pred_3 obj_09 obj_02 obj_04)
   goals met: 0 of 3
2. (op_2 obj_06 obj_11 obj_08 obj_12)
   deleted: (pred_2 obj_11 obj_08) (pred_4 obj_06 obj_12)
   added: (pred_3 obj_06 obj_11 obj_12)
   goals met: 0 of 3
3. (op_3 obj_09 obj_10 obj_03)
   deleted: (pred_1 obj_09 obj_10)
   added: (pred_1 obj_09 obj_03)
   goals met: 0 of 3
4. (op_3 obj_06 obj_08 obj_10)
   deleted: (pred_1 obj_06 obj_08)
   added: (pred_1 obj_06 obj_10)
   goals met: 0 of 3
5. (op_1 obj_09 obj_02 obj_03 obj_04)
   deleted: (pred_3 obj_09 obj_02 obj_04)
   added: (pred_2 obj_02 obj_03) (pred_4 obj_09 obj_04)
   goals met: 1 of 3
6. (op_1 obj_06 obj_11 obj_10 obj_12)
   deleted: (pred_3 obj_06 obj_11 obj_12)
   added: (pred_2 obj_11 obj_10) (pred_4 obj_06 obj_12)
   goals met: 2 of 3
7. (op_2 obj_09 obj_05 obj_03 obj_07)
   deleted: (pred_2 obj_05 obj_03) (pred_4 obj_09 obj_07)
   added: (pred_3 obj_09 obj_05 obj_07)
   goals met: 2 of 3
8. (op_3 obj_09 obj_03 obj_01)
   deleted: (pred_1 obj_09 obj_03)
   added: (pred_1 obj_09 obj_01)
   goals met: 2 of 3
9. (op_1 obj_09 obj_05 obj_01 obj_07)
   deleted: (pred_3 obj_09 obj_05 obj_07)
   added: (pred_2 obj_05 obj_01) (pred_4 obj_09 obj_07)
   goals met: 3 of 3
